In [1]:
import pandas as pd
import numpy as np

### Method1 : Creating  Dataframe from Lists

In [2]:
data1 = [10,20,30,40,50,60]

In [3]:
data1

[10, 20, 30, 40, 50, 60]

In [4]:
df1 = pd.DataFrame(data1, columns=['Numbers'])

In [5]:
df1

   Numbers
0       10
1       20
2       30
3       40
4       50
5       60

### Method2 :  Creating Pandas DataFrame from lists of lists.

In [6]:
data2 = [['tom', 10], ['nick', 15], ['juli', 14]]

In [7]:
df2 = pd.DataFrame(data2, columns=['Name', 'Age'])

In [8]:
df2

   Name  Age
0   tom   10
1  nick   15
2  juli   14

### Method3: Creating DataFrame from dict of narray/lists

In [9]:
data3 = {'Name': ['Tom', 'nick', 'krish', 'jack'],
        'Age': [20, 21, 19, 18]}

In [10]:
df3 = pd.DataFrame(data3)

In [11]:
df3

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

### Method4: Creating a DataFrame by proving index label explicitly.

In [12]:
data4 = {'Name': ['Tom', 'Jack', 'nick', 'juli'],
        'marks': [99, 98, 95, 90]}

In [13]:
df = pd.DataFrame(data4, index=['rank1','rank2','rank3','rank4'])

In [14]:
df

       Name  marks
rank1   Tom     99
rank2  Jack     98
rank3  nick     95
rank4  juli     90

### Method5: Creating Dataframe from list of dicts

In [15]:
data5 = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30}]

In [16]:
df5 = pd.DataFrame(data5)

In [17]:
df5

    a   b   c
0   1   2   3
1  10  20  30

In [18]:
df6 = pd.DataFrame(data5, index=['first', 'second'])

In [19]:
df6

         a   b   c
first    1   2   3
second  10  20  30

In [20]:
df7 = pd.DataFrame(data5, index=['first','second'],columns=['a', 'b'])

In [21]:
df7

         a   b
first    1   2
second  10  20

In [22]:
df8 = pd.DataFrame(data5, index=['first','second'],columns=['a', 'b2'])

In [23]:
df8

         a  b2
first    1 NaN
second  10 NaN

### Method6: Creating DataFrame using zip() function.

In [24]:
Name = ['tom', 'krish', 'nick', 'juli']

In [25]:
Age = [25, 30, 26, 22]

In [26]:
list_of_tuples = list(zip(Name, Age))

In [27]:
df9 = pd.DataFrame(list_of_tuples,columns=['Name', 'Age'])

In [28]:
df9

    Name  Age
0    tom   25
1  krish   30
2   nick   26
3   juli   22

### Method7:  Creating dataframe from series

In [29]:
d1 =  pd.Series([10, 20, 30, 40])

In [30]:
d1

0    10
1    20
2    30
3    40
dtype: int64

In [31]:
df10 = pd.DataFrame(d1)

In [32]:
df10

    0
0  10
1  20
2  30
3  40

### Method8: Creating DataFrame from Dictionary of series.

In [33]:
d2 = {'one': pd.Series([10, 20, 30, 40],index=['a', 'b', 'c', 'd']),
     'two': pd.Series([10, 20, 30, 40],index=['a', 'b', 'c', 'd'])}

In [34]:
df11 = pd.DataFrame(d2)

In [35]:
df11

   one  two
a   10   10
b   20   20
c   30   30
d   40   40